proj-xcode/TestClasses/PowerAuthServerSOAP/SoapRequests.bundle/GetNonpersonalizedEncryptionKey.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:pow="http://getlime.io/security/powerauth">
	<soapenv:Header/>
	<soapenv:Body>
		<pow:GetNonPersonalizedEncryptionKeyRequest>
			<pow:applicationKey>$1</pow:applicationKey>
			<pow:sessionIndex>$2</pow:sessionIndex>
			<pow:ephemeralPublicKey>$3</pow:ephemeralPublicKey>
		</pow:GetNonPersonalizedEncryptionKeyRequest>
	</soapenv:Body>
</soapenv:Envelope>
